Microchip-MPLAB-Harmony/net/apps/web_server_nvm_mpfs/firmware/src/config/pic32_mz/driver/ethmac/src/dynamic - Copy/drv_eth_pic32_plib.h


#ifndef _DRV_ETH_PIC32_PLIB_H
#define _DRV_ETH_PIC32_PLIB_H

/* Section 1 - Enumerate instances, define constants, VREGs */

#include <xc.h>
#include <stdbool.h>

/* Default definition used for all API dispatch functions */
#ifndef PLIB_INLINE_API
    #define PLIB_INLINE_API extern inline
#endif

/* Default definition used for all other functions */
#ifndef PLIB_INLINE
    #define PLIB_INLINE extern inline
#endif


PLIB_INLINE_API void PLIB_ETH_PauseTimerSet(ETH_MODULE_ID index, uint16_t PauseTimerValue)
{
     ETH_PauseTimerSet_Default(index, PauseTimerValue);
}

PLIB_INLINE_API uint16_t PLIB_ETH_PauseTimerGet(ETH_MODULE_ID index)
{
     return ETH_PauseTimerGet_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsPauseTimer(ETH_MODULE_ID index)
{
     return ETH_ExistsPauseTimer_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_Enable(ETH_MODULE_ID index)
{
     ETH_Enable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_Disable(ETH_MODULE_ID index)
{
     ETH_Disable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_IsEnabled(ETH_MODULE_ID index)
{
     return ETH_IsEnabled_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsEnable(ETH_MODULE_ID index)
{
     return ETH_ExistsEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_StopInIdleEnable(ETH_MODULE_ID index)
{
     ETH_StopInIdleEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_StopInIdleDisable(ETH_MODULE_ID index)
{
     ETH_StopInIdleDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_StopInIdleIsEnabled(ETH_MODULE_ID index)
{
     return ETH_StopInIdleIsEnabled_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsStopInIdle(ETH_MODULE_ID index)
{
     return ETH_ExistsStopInIdle_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_TxRTSEnable(ETH_MODULE_ID index)
{
     ETH_TxRTSEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_TxRTSDisable(ETH_MODULE_ID index)
{
     ETH_TxRTSDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_TxRTSIsEnabled(ETH_MODULE_ID index)
{
     return ETH_TxRTSIsEnabled_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsTransmitRTS(ETH_MODULE_ID index)
{
     return ETH_ExistsTransmitRTS_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_RxEnable(ETH_MODULE_ID index)
{
     ETH_RxEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_RxDisable(ETH_MODULE_ID index)
{
     ETH_RxDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_RxIsEnabled(ETH_MODULE_ID index)
{
     return ETH_RxIsEnabled_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsRxEnable(ETH_MODULE_ID index)
{
     return ETH_ExistsRxEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_AutoFlowControlEnable(ETH_MODULE_ID index)
{
     ETH_AutoFlowControlEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_AutoFlowControlDisable(ETH_MODULE_ID index)
{
     ETH_AutoFlowControlDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_AutoFlowControlIsEnabled(ETH_MODULE_ID index)
{
     return ETH_AutoFlowControlIsEnabled_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsAutoFlowControl(ETH_MODULE_ID index)
{
     return ETH_ExistsAutoFlowControl_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_ManualFlowControlEnable(ETH_MODULE_ID index)
{
     ETH_ManualFlowControlEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_ManualFlowControlDisable(ETH_MODULE_ID index)
{
     ETH_ManualFlowControlDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ManualFlowControlIsEnabled(ETH_MODULE_ID index)
{
     return ETH_ManualFlowControlIsEnabled_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsManualFlowControl(ETH_MODULE_ID index)
{
     return ETH_ExistsManualFlowControl_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_RxBufferCountDecrement(ETH_MODULE_ID index)
{
     ETH_RxBufferCountDecrement_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsRxBufferCountDecrement(ETH_MODULE_ID index)
{
     return ETH_ExistsRxBufferCountDecrement_Default(index);
}

PLIB_INLINE_API uint8_t PLIB_ETH_ReceiveBufferSizeGet(ETH_MODULE_ID index)
{
     return ETH_ReceiveBufferSizeGet_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_ReceiveBufferSizeSet(ETH_MODULE_ID index, uint8_t ReceiveBufferSize)
{
     ETH_ReceiveBufferSizeSet_Default(index, ReceiveBufferSize);
}

PLIB_INLINE_API int PLIB_ETH_RxSetBufferSize(ETH_MODULE_ID index, int rxBuffSize)
{
     return ETH_RxSetBufferSize_Default(index, rxBuffSize);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsReceiveBufferSize(ETH_MODULE_ID index)
{
     return ETH_ExistsReceiveBufferSize_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_TxPacketDescAddrSet(ETH_MODULE_ID index, uint8_t* txPacketDescStartAddr)
{
     ETH_TxPacketDescAddrSet_Default(index, txPacketDescStartAddr);
}

PLIB_INLINE_API uint8_t* PLIB_ETH_TxPacketDescAddrGet(ETH_MODULE_ID index)
{
     return ETH_TxPacketDescAddrGet_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsTxPacketDescriptorAddress(ETH_MODULE_ID index)
{
     return ETH_ExistsTxPacketDescriptorAddress_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_RxPacketDescAddrSet(ETH_MODULE_ID index, uint8_t* rxPacketDescStartAddr)
{
     ETH_RxPacketDescAddrSet_Default(index, rxPacketDescStartAddr);
}

PLIB_INLINE_API uint8_t* PLIB_ETH_RxPacketDescAddrGet(ETH_MODULE_ID index)
{
     return ETH_RxPacketDescAddrGet_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsRxPacketDescriptorAddress(ETH_MODULE_ID index)
{
     return ETH_ExistsRxPacketDescriptorAddress_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_HashTableSet(ETH_MODULE_ID index, uint64_t hashTableValue)
{
     ETH_HashTableSet_Default(index, hashTableValue);
}

PLIB_INLINE_API uint32_t PLIB_ETH_HashTableGet(ETH_MODULE_ID index)
{
     return ETH_HashTableGet_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_RxFiltersHTSet(ETH_MODULE_ID index, uint64_t htable)
{
     ETH_RxFiltersHTSet_Default(index, htable);
}

